tutorials/lagrangian/simpleReactingParcelFoam/verticalChannel/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-9;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }

    front
    {
        type            symmetryPlane;
    }

    inletCentral
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.15;
        value           uniform 3.75e-9;
    }

    inletSides
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.16;
        value           uniform 3.75e-9;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-9;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
